Service - Investment Income Reporting/Product - AIL/sample messages/AILFileRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Header xmlns:a="http://www.w3.org/2005/08/addressing">
      <a:Action>https://services.ird.govt.nz/GWS/Returns/Return/File</a:Action>
   </soap:Header>
   <soap:Body>
      <r:File xmlns:r="https://services.ird.govt.nz/GWS/Returns/">
         <r:ReturnFileRequestMsg>
            <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
               <ret:fileRequest xmlns:ret="urn:www.ird.govt.nz/GWS:types/ReturnAIL.v1">
                  <ret1:fileHeader xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                     <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2">
                        <com:softwareProvider>softwareProvider</com:softwareProvider>
                        <com:softwarePlatform>softwarePlatform</com:softwarePlatform>
                        <com:softwareRelease>v1</com:softwareRelease>
                     </com:softwareProviderData>
                     <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2" IdentifierValueType="IRD">123768566</com:identifier>
                     <com:accountType xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2">AIL</com:accountType>
                     <ret1:periodEndDate>2019-09-30</ret1:periodEndDate>
                     <ret1:majorFormType>AIL</ret1:majorFormType>
                     <ret1:minorFormType>AIL</ret1:minorFormType>
                  </ret1:fileHeader>
                  <ret1:fileBody xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                     <ret1:standardFields>
                        <ret1:isNilReturn>false</ret1:isNilReturn>
                        <ret1:amendmentRequest>
                           <ret1:isAmended>false</ret1:isAmended>
                           <ret1:amendReason xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                           <ret1:amendDetails/>
                        </ret1:amendmentRequest>
                     </ret1:standardFields>
                     <ret1:formFields xsi:type="ret:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                        <ret:isReverseReplace>false</ret:isReverseReplace>
                        <ret:lineItems>
                           <ret:externalID>123</ret:externalID>
                           <ret:primaryName>Rachel Lawrence</ret:primaryName>
                           <ret:primaryCountry>NZ</ret:primaryCountry>
                           <ret:primaryAddress>test</ret:primaryAddress>
                           <ret:incomeInformation>
                              <ret1:grossAmount>5005</ret1:grossAmount>
                              <ret1:deductedAmount>53</ret1:deductedAmount>
                              <ret:interestZeroRated>50</ret:interestZeroRated>
                           </ret:incomeInformation>
                        </ret:lineItems>
                     </ret1:formFields>
                  </ret1:fileBody>
               </ret:fileRequest>
            </fil:FileRequestWrapper>
         </r:ReturnFileRequestMsg>
      </r:File>
   </soap:Body>
</soap:Envelope>